#include <iostream>

int main() {
    printf("八進制 101 的字元為：\101\n");
    printf("八進制 102 的字元為：\102\n");
    printf("八進制 103 的字元為：\103\n");
    printf("八進制 104 的字元為：\104\n");
    printf("八進制 105 的字元為：\105\n");
    printf("八進制 106 的字元為：\106\n");
    printf("八進制 107 的字元為：\107\n");
    printf("八進制 110 的字元為：\110\n");
    printf("八進制 111 的字元為：\111\n");
    printf("八進制 112 的字元為：\112\n");
    printf("八進制 113 的字元為：\113\n");
    printf("八進制 114 的字元為：\114\n");
    printf("八進制 115 的字元為：\115\n");
    printf("八進制 116 的字元為：\116\n");
    printf("八進制 117 的字元為：\117\n");
    printf("八進制 120 的字元為：\120\n");
    printf("八進制 121 的字元為：\121\n");
    printf("八進制 122 的字元為：\122\n");
    printf("八進制 123 的字元為：\123\n");
    printf("八進制 124 的字元為：\124\n");
    printf("八進制 125 的字元為：\125\n");
    printf("八進制 126 的字元為：\126\n");
    printf("八進制 127 的字元為：\127\n");
    printf("八進制 130 的字元為：\130\n");
    printf("八進制 131 的字元為：\131\n");
    printf("八進制 132 的字元為：\132\n");
    return 0;
}